{
  "date": "2026-02-27",
  "title": "Feb 27, 2026",
  "summary": "Hot-swap model chooser for the BMC execution engine, IB Trading Tools rebrand, Manual Trading v2, Event Driven Portfolio gains Curate + Monitor tabs, theta columns, and managed account filtering.",
  "features": [
    {
      "id": "hot-swap-model-chooser",
      "title": "Hot-Swap Model Chooser (v1.13.0)",
      "summary": "Browse and load ML models from the dashboard while the execution engine keeps running — zero downtime model switching.",
      "description": "The Algorithmic (Signals) tab now lets you browse all models in the registry and swap the active model without stopping the engine.\n\n**How it works:**\n- Click the model type label (e.g. \"lightgbm/SPY\") on a running strategy to open the model chooser\n- A compact table shows all available models: version, type, recipe, date, status badge, AUC, and profit factor\n- The currently loaded model is highlighted; click \"Load\" on any other model to hot-swap it in\n- The swap is GIL-atomic — the eval loop never pauses, and the next decision cycle uses the new model immediately\n\n**What's under the hood:**\n- New `execution_list_models` and `execution_swap_model` commands flow through the full 4-layer relay (UI → Next.js → FastAPI → WebSocket → Agent)\n- Model reference is swapped first (thread-safe), then metadata updates follow\n- Decision cycle snapshots model + metadata into locals at the top, so lineage and signal logs always match the exact model used for each prediction\n- Concurrent swap guard prevents double-click races\n- Registry errors are caught gracefully with descriptive messages\n\n**Use case:** Switch between LightGBM tabular models and LSTM sequence models on the fly. Compare model performance in real-time without restarting strategies or losing accumulated bar data and Polygon WS state.",
      "category": "signals",
      "project": "ma-options",
      "image": "",
      "screenshot": null
    },
    {
      "id": "ib-trading-tools-rebrand",
      "title": "IB Trading Tools Rebrand",
      "summary": "M&A Options Scanner renamed to IB Trading Tools with restructured tabs: Manual, Manual v2, and Algorithmic.",
      "description": "The homepage card formerly labeled \"M&A Options Scanner\" is now \"IB Trading Tools\" to better reflect its evolved scope.\n\n**Tab restructure:** The Curate and Monitor tabs (event-driven portfolio curation) have moved to the Event Driven Portfolio page where they belong. The IB Trading Tools page now has three focused tabs:\n- **Manual** — The original Account tab (IBPositionsTab), unchanged\n- **Manual v2** — New inline trading interface with net greeks (see below)\n- **Algorithmic** — The Signals tab for BMC execution controls\n\nThe permission key remains \"ma-options\" so no user permission changes are needed.",
      "category": "general",
      "project": "ma-options",
      "image": "",
      "screenshot": null
    },
    {
      "id": "manual-trading-v2",
      "title": "Manual Trading v2 — Inline Everything",
      "summary": "New trading interface: sortable ticker table with net greeks, full-page detail view, and inline order ticket with zero popups.",
      "description": "A complete redesign of the manual trading workflow, purpose-built for accessibility. Every interaction happens inline — no modals, no overlays, no X buttons to find.\n\n**Ticker Summary Table:**\n- All positions grouped by underlying ticker in a sortable table\n- Columns: Stock position, Options count, Spot price, Notional value, Net Delta, Net Gamma, Net Theta, P&L\n- Click any column header to sort (ascending/descending toggle)\n- Inline add-ticker row with SEC EDGAR autocomplete (no modal)\n- Column chooser for customizing visible columns\n\n**Ticker Detail View:**\n- Click any ticker row to enter a full-page detail view\n- \"← Back to positions\" button (large, clear text, no X icon)\n- Greek summary strip: Net Δ, Stock Δ, Options Δ, Net Γ, Net Θ, Net V\n- Position legs table showing all STK + OPT positions with per-leg delta\n- Click an option leg to pre-fill the order ticket with that contract\n- Working orders filtered to just this ticker, with inline edit/cancel\n\n**Inline Order Ticket:**\n- Rendered in the page flow, not as a fixed overlay\n- BUY/SELL toggle with large color-coded buttons (52px+)\n- Order types: LMT, STP LMT, MOC\n- Quantity input (text-4xl) with delta buttons (+1, +2, +5, +10, +25, +50, +100)\n- Price input (text-4xl) with delta buttons (±0.01, ±0.05, ±0.10, ±0.25, ±0.50)\n- Delta sign (+/−) toggle, TIF (DAY/GTC), Outside RTH toggle\n- **Inline confirmation**: Submit → ticket transitions to confirmation state showing order summary + \"Confirm [BUY/SELL] — Send Order\" / Cancel buttons. No dialog popup.\n\n**Greeks Pipeline:**\n- Delta, gamma, theta, vega, and implied volatility now flow from IB through the agent → relay → frontend pipeline\n- Net delta = stock_qty + Σ(option_qty × contract_delta × 100)\n- Greeks show \"—\" when unavailable (Polygon source or IB disconnected)\n\nThe v1 Manual tab is preserved unchanged as an A/B reference.",
      "category": "positions",
      "project": "ma-options",
      "image": "",
      "screenshot": null
    },
    {
      "id": "manual-v2-accessibility-revision",
      "title": "Manual Trading v2 — Accessibility Revision",
      "summary": "Larger buttons, Clear buttons, totals row, and merged header — based on direct user testing feedback.",
      "description": "User testing with the Parkinson's accessibility user revealed the initial v2 buttons were \"compacted but too compact.\" This revision brings v2 to parity with v1's trade ticket gold standard.\n\n**3-Column Grid Layout (latest):**\nThe order ticket now uses a 3-column grid (controls | quantity | price) inspired by the v1 trade ticket pattern, replacing the previous full-width horizontal rows:\n- **Left column (180px)**: BUY/SELL, +/−, order type (stacked with friendly labels: \"Limit\", \"Stop Limit\", \"MOC\"), TIF, RTH — all grouped vertically for top-to-bottom scanning\n- **Center column**: Qty input (68px, text-4xl) with Clear/Round utility row and delta buttons in grid-cols-4 (~85-130px per button, not 200px+)\n- **Right column**: Limit/Stop price inputs with same utility+delta pattern; MOC shows \"No price required\" message\n- Delta buttons fill ~350px column width instead of spanning 1400px page width\n- Input + its delta buttons are in the same column, visually connected\n- Falls to single column on narrow screens (md breakpoint)\n- Summary line, error display, and submit button remain full-width below the grid\n\n**Previous accessibility improvements (retained):**\n- All controls ≥ 44px touch targets, inputs at 68px, submit at 60px\n- Clear buttons on every input field (Qty → \"0\", Price → \"0.00\")\n- Round up/down buttons with labeled text (\"↓ Round\", \"↑ Round\")\n\n**Position Legs Totals Row:**\n- When a ticker has both stock and option positions (2+ rows), a totals row appears in the table footer\n- Shows combined Market Value, P&L (color-coded), and net Delta across all legs\n- Respects column chooser — only visible columns get totals cells\n\n**Header + Greek Strip Merge:**\n- Ticker info (name, price, shares, refresh) and Greek badges now share one row instead of two\n- Greeks are right-aligned, filling the previously empty right side of the header bar\n- Saves one full row of vertical space",
      "category": "positions",
      "project": "ma-options",
      "image": "",
      "screenshot": null
    },
    {
      "id": "event-driven-portfolio-tabs",
      "title": "Event Driven Portfolio Gains Curate + Monitor",
      "summary": "The Curate and Monitor tabs now live under the Event Driven Portfolio page, with the existing portfolio view as the default tab.",
      "description": "The Event Driven Portfolio page now has three tabs:\n- **Portfolio** (default) — The existing deal table with live prices, risk grades, and AI assessments\n- **Curate** — Deal selector, option chain viewer, and candidate strategy builder (moved from M&A Options Scanner)\n- **Monitor** — Watched spreads with live price monitoring (moved from M&A Options Scanner)\n\nThe page now uses a server/client architecture: the server component fetches scanner deals from Prisma, while the client component wraps everything in IBConnectionProvider so Curate and Monitor tabs can access IB data.\n\nThis reorganization puts event-driven portfolio curation tools where they logically belong — alongside the portfolio data they operate on.",
      "category": "portfolio",
      "project": "sheet-portfolio",
      "image": "",
      "screenshot": null
    },
    {
      "id": "theta-columns",
      "title": "Theta Column in Manual v2 Tables",
      "summary": "Net Θ now visible by default in the summary table, and per-leg Θ added to the position legs table with color-coded totals.",
      "description": "Theta was already computed through the greeks pipeline but wasn't surfaced in the tables.\n\n**Summary Table:**\n- Net Θ column added to defaults — visible immediately without toggling the column chooser\n- Negative theta in red, positive in green, matching the delta color convention\n- Sortable like all other columns\n\n**Position Legs Table:**\n- New Θ column shows per-position theta contribution (qty × greek × multiplier)\n- Included in defaults automatically (LEG_DEFAULTS includes all columns)\n- Totals row in the footer shows combined theta across all legs when 2+ positions exist\n- Available in the column chooser for hide/show control",
      "category": "positions",
      "project": "ma-options",
      "image": "",
      "screenshot": null
    },
    {
      "id": "managed-account-filter",
      "title": "Managed Account Excluded from IB Trading Tools",
      "summary": "Advisor-managed IB account (U22621569) is now filtered out at the API level — only your personal account positions and orders appear.",
      "description": "Users with both a personal and advisor-managed IB account were seeing positions from both accounts merged together in the Manual and Manual v2 tabs. The managed account's positions can't be traded through the dashboard (the advisor manages them), so showing them created confusion.\n\n**What changed:**\n- The `/api/ib-connection/positions` and `/api/ib-connection/open-orders` API routes now filter out account U22621569 before returning data\n- Both the v1 Manual tab and v2 Manual tab benefit from this since they share the same API endpoints\n- No UI changes needed — the managed positions simply no longer appear",
      "category": "positions",
      "project": "ma-options",
      "image": "",
      "screenshot": null
    },
    {
      "id": "greeks-pipeline-fix",
      "title": "Greeks Pipeline Fix (v1.14.1)",
      "summary": "Delta, gamma, theta, and vega now flow correctly from IB through the agent — previously only delta was stored, and all greeks were lost when their value was 0.",
      "description": "Two bugs in the IB data agent prevented greeks from reaching the dashboard:\n\n**Bug 1 — Missing greeks in callback:** The `tickOptionComputation` callback (which IB fires with all greeks) was only storing `delta` into the option chain data. Gamma, theta, and vega were silently discarded, staying at their initialization value of 0.\n\n**Bug 2 — Truthiness filtering:** The agent used Python truthiness checks (`and opt.delta`) to decide whether to include greeks in the API response. Since 0 is falsy in Python, any greek that stayed at 0 (either from the bug above or because the callback hadn't fired yet) was converted to `null`.\n\n**Bug 3 — IB sentinel values:** IB sends `1.7976931348623157e+308` (Double.MAX_VALUE) when it can't compute a greek. The agent now filters these out instead of passing them through as absurdly large numbers.\n\n**Note:** 0DTE options may still show \"—\" for greeks when IB can't compute them (e.g., after the last computation cycle before expiry). This is expected IB behavior, not a bug.\n\nRequires agent restart to pick up v1.14.1.",
      "category": "signals",
      "project": "ma-options",
      "image": "",
      "screenshot": null
    }
  ]
}
