{
  "date": "2026-02-15",
  "title": "Week of Feb 9–15, 2026",
  "summary": "UI configurability: column chooser, comfort mode for accessibility, position persistence fix, and optimized signal columns.",
  "features": [
    {
      "id": "column-chooser",
      "title": "Column Chooser",
      "summary": "Show or hide any column on the KRJ signals table — your selection is saved automatically",
      "description": "A new columns icon in the KRJ toolbar opens a dropdown where you can toggle any column on or off. Your column selection is saved to your account and persists across sessions and devices.\n\nThis is especially useful as new signal types are added (like the optimized signal columns). You choose exactly what you want to see, and the table adapts. A “Reset to defaults” option at the bottom restores the original column set.\n\nThe column chooser is built as a reusable component — expect it on other tables soon.",
      "category": "signals",
      "image": "/changelog/2026-02-15/column-chooser.png",
      "screenshot": {
        "path": "/krj",
        "actions": [
          { "type": "wait", "ms": 3000 },
          { "type": "click", "selector": "button[title='Choose columns']" },
          { "type": "wait", "ms": 500 }
        ],
        "viewport": { "width": 1400, "height": 900 },
        "annotations": [
          {
            "type": "circle",
            "selector": "button[title='Choose columns']",
            "label": "Column chooser"
          }
        ]
      }
    },
    {
      "id": "comfort-mode",
      "title": "Comfort Mode",
      "summary": "Toggle between compact and comfort density — larger text and touch targets for accessibility",
      "description": "A new Comfort Mode toggle in the user menu switches the UI between two density levels.\n\nCompact mode (the default for most pages) preserves the existing high-density trader layout. Comfort mode increases font sizes, button targets (44px minimum), and spacing for easier interaction.\n\nIn comfort mode, the KRJ signals table uses fluid scaling: font sizes and padding automatically adjust based on the viewport width and number of visible columns. Fewer columns means each one gets more room. The table fills the screen intelligently without requiring manual adjustments.\n\nYour preference is saved to your account and applies across all pages.",
      "category": "general",
      "image": "/changelog/2026-02-15/comfort-mode.png",
      "screenshot": {
        "path": "/krj",
        "actions": [
          { "type": "wait", "ms": 3000 }
        ],
        "viewport": { "width": 1400, "height": 900 },
        "annotations": [
          {
            "type": "arrow",
            "selector": "button:has-text('DR3_dev')",
            "label": "Comfort Mode toggle in user menu",
            "from_offset": [-80, -60]
          }
        ]
      }
    },
    {
      "id": "optimized-signals",
      "title": "Optimized Signal Columns",
      "summary": "New optimized signal variants available via the column chooser (hidden by default)",
      "description": "Two new signal columns have been added to the KRJ column registry:\n\n- **Optimized Signal** — current week signal using optimized thresholds\n- **Last Week Opt Signal** — prior week optimized signal\n\nThese columns are hidden by default to keep the table clean. Toggle them on via the column chooser when you want to compare optimized vs. standard signals.\n\nThe columns will show data automatically as optimized signal calculations are rolled out in the CSV pipeline.",
      "category": "signals",
      "image": "/changelog/2026-02-15/optimized-signals.png",
      "screenshot": {
        "path": "/krj",
        "actions": [
          { "type": "wait", "ms": 3000 },
          { "type": "click", "selector": "button[title='Choose columns']" },
          { "type": "wait", "ms": 500 }
        ],
        "viewport": { "width": 1400, "height": 900 },
        "annotations": [
          {
            "type": "arrow",
            "selector": "span:has-text('Optimized Signal')",
            "label": "New optimized signal columns",
            "from_offset": [-60, -40]
          }
        ]
      }
    },
    {
      "id": "position-persistence",
      "title": "Position Box Persistence Fix",
      "summary": "Selected position boxes now reliably survive page refresh and tab switches",
      "description": "Fixed a race condition that could cause your selected position boxes on the Account tab to reset when you refreshed the page or switched tabs.\n\nThe root cause was two competing save operations (selected tickers and manual tickers) that could overwrite each other. Both now use a centralized preferences context that batches changes into a single write, eliminating the race.\n\nYour position box selections are now reliably saved and restored across sessions.",
      "category": "positions",
      "image": "/changelog/2026-02-15/position-persistence.png",
      "screenshot": null
    },
    {
      "id": "ui-prefs-infrastructure",
      "title": "UI Preferences Infrastructure",
      "summary": "New centralized preferences context eliminates per-component save races",
      "description": "Under the hood, a new UIPreferencesProvider context wraps the entire app. It loads all user preferences once on startup and provides them to every component via a React hook.\n\nInstead of each component independently fetching and saving preferences (which caused race conditions), all preference updates flow through the context. Changes are debounced and batched into a single API call.\n\nThis infrastructure supports the column chooser, comfort mode, and all future UI configurability features without adding new database tables or API endpoints.",
      "category": "general",
      "image": "",
      "screenshot": null
    }
  ]
}
