{
  "date": "2026-02-24",
  "title": "Feb 24, 2026",
  "summary": "Live Polygon prices, chained detail ingest, diff highlights, and BamSEC filing links.",
  "features": [
    {
      "id": "live-polygon-prices",
      "title": "Live Stock Prices on Portfolio Dashboard",
      "summary": "The Event Driven Portfolio now shows real-time Polygon stock prices that auto-refresh every 60 seconds.",
      "description": "The portfolio dashboard (/sheet-portfolio) now fetches live stock prices from Polygon instead of relying on stale Google Sheet data.\n\n**Live price overlay:** The Crrnt Px column shows real-time prices in cyan when available, falling back to the sheet price if Polygon is unreachable.\n\n**Market data status pill:** A status indicator in the header shows a green health dot, the exact timestamp of the last market data fetch (e.g. \"Mkt data 2:25:13 PM\"), and an inline refresh button to fetch on demand in fast markets.\n\n**Auto-refresh:** Prices poll every 60 seconds with a document.hidden guard so backgrounded tabs don't waste API calls.\n\n**Recalculated yields:** Gross Yield and Current Yield columns recalculate on-the-fly using live prices, shown in cyan to distinguish from stale sheet values.\n\n**Live price change:** The Px Chng column shows Polygon's change percentage with green/red coloring.\n\n**Graceful degradation:** If Polygon is unavailable, all columns fall back to stale sheet values with no errors shown. The sheet Re-ingest button remains available for manual Google Sheet refreshes.",
      "category": "portfolio",
      "project": "sheet-portfolio",
      "image": "",
      "screenshot": null
    },
    {
      "id": "rename-event-driven-portfolio",
      "title": "Renamed to Event Driven Portfolio",
      "summary": "The homepage card formerly labeled \"Sheet Portfolio\" is now \"Event Driven Portfolio\".",
      "description": "The homepage dashboard card has been renamed from \"Sheet Portfolio\" to \"Event Driven Portfolio\" to better reflect the tool's purpose as an event-driven M&A portfolio tracker.",
      "category": "portfolio",
      "project": "sheet-portfolio",
      "image": "",
      "screenshot": null
    },
    {
      "id": "bamsec-filing-link",
      "title": "BamSEC Filing Link on Deal Pages",
      "summary": "Each deal detail page now has a direct BamSEC link for quick access to SEC filings.",
      "description": "The deal detail page header now shows a BamSEC link alongside the Yahoo Quote link. Clicking it opens the target company's SEC filings on BamSEC (e.g. bamsec.com/companies/924901/veris-residential-inc for VRE).\n\nThe link is resolved automatically by looking up the ticker's CIK number from SEC data and constructing the BamSEC URL. If the ticker can't be resolved, the link gracefully doesn't appear.",
      "category": "portfolio",
      "project": "sheet-portfolio",
      "image": "",
      "screenshot": null
    },
    {
      "id": "chained-detail-ingest",
      "title": "Re-ingest Now Includes Deal Details",
      "summary": "Clicking Re-ingest Sheet now automatically ingests all ~50 deal detail tabs, not just the dashboard CSV.",
      "description": "Previously, clicking Re-ingest Sheet only ingested the dashboard-level CSV (tickers, prices, yields). The 60+ fields on each deal's detail page were only populated by a scheduled job at 6:35 AM ET, meaning mid-day re-ingests left deal detail pages showing dashes.\n\n**Two-phase ingest:** The button now runs the dashboard ingest (~500ms), refreshes the table, then automatically ingests all deal detail tabs (~5s for ~50 deals), and refreshes again. The button stays disabled throughout and shows \"Ingesting...\" then \"Refreshing details...\" with a final count like \"Ingested 82 rows + 80 deal details\".\n\n**Faster detail parsing:** Concurrency increased from 3 to 5 concurrent requests with sleep reduced from 0.5s to 0.2s between batches, cutting total time from ~15s to ~5s while staying well within Google Sheets rate limits.",
      "category": "portfolio",
      "project": "sheet-portfolio",
      "image": "",
      "screenshot": null
    },
    {
      "id": "diff-highlights",
      "title": "New/Changed Deal Highlights",
      "summary": "New deals show a green left border and NEW pill; modified deals show an amber left border with a tooltip.",
      "description": "The portfolio dashboard now fetches diff data comparing the current snapshot to the previous one and subtly highlights changes.\n\n**New deals:** A thin green left border on the row plus a small muted \"NEW\" pill next to the ticker.\n\n**Modified deals:** A thin amber left border on the row. Hovering the ticker shows a tooltip listing which fields changed (e.g. \"Changed: legal_risk, deal_price_raw\").\n\n**Unchanged deals:** No visual change from before.\n\nThe diff data is fetched in parallel with the deals, health, and risk data on every page load and after each re-ingest.",
      "category": "portfolio",
      "project": "sheet-portfolio",
      "image": "",
      "screenshot": null
    },
    {
      "id": "admin-user-management",
      "title": "Admin User Management Screen",
      "summary": "New /admin/users page lets the admin toggle project access on/off per user with instant-save switches.",
      "description": "A new admin-only screen at /admin/users provides a table of all registered users with toggle switches for each project (KRJ Dashboard, M&A Options Scanner, Event Driven Portfolio).\n\n**Instant save:** Toggle switches use optimistic updates -- the UI flips immediately and PUTs to the API in the background. On failure, the toggle reverts and shows an inline error.\n\n**Admin gating:** The middleware blocks non-admin users from /admin/** and /api/admin/** routes, redirecting them to the dashboard. The \"Manage Users\" link in the UserMenu dropdown is only visible to the admin account.\n\n**User details:** The table shows each user's alias, email, role, project access toggles, and active status indicator.",
      "category": "general",
      "image": "",
      "screenshot": null
    }
  ]
}
